/* Status text for queued multi-part archives */
"%@ (+%d more)" = "%1$@ (еще +%2$d)";

/* Error message string. The first %@ is the file name, the second the archive name, the third is error message */
"Could not extract the file \"%@\" from the archive \"%@\": %@" = "Не удалось извлечь «%1$@» из архива «%2$@»: %3$@";

/* Error message string. The first %@ is the file name, the second the archive name, the third is error message */
"Could not extract the resource fork for the file \"%@\" from the archive \"%@\":\n%@" = "Невозможно извлечь ветвь ресурсов файла «%1$@» из архива «%2$@»:\n%3$@";

/* Option in the password encoding pop-up to use the default encoding */
"Default encoding" = "Стандартная кодировка";

/* Option in the encoding pop-up to detect the encoding automatically */
"Detect automatically" = "Определять автоматически";

/* Panel OK button title when choosing an unarchiving destination for an archive */
"Extract" = "Распаковать в";

/* Panel title when choosing an unarchiving destination for an archive */
"Extract Archive" = "Распаковка архива";

/* Status text while extracting an archive */
"Extracting \"%@\"" = "Распаковываю «%@»";

/* Status text when preparing to extract an archive */
"Preparing to extract \"%@\"" = "Готовлюсь к распаковке «%@»";

/* Panel OK button title when choosing a default unarchiving destination */
"Select" = "Выбрать";

/* Panel title when choosing archives to extract */
"Select files to unarchive" = "Выберите файлы для распаковки";

/* Error message for files not extractable by The Unarchiver */
"The contents of the file \"%@\" can not be extracted with this program." = "The Unarchiver не может извлечь содержимое «%@».";

/* Error message when encountering an error while extracting entries */
"There was a problem while extracting the contents of the file \"%@\": %@" = "Возникла проблема при распаковке файла «%1$@»: %2$@";

/* Error message when encountering an error while parsing an archive */
"There was a problem while reading the contents of the file \"%@\": %@" = "Возникла проблема при чтении содержимого файла «%1$@»: %2$@";

/* Panel OK button title when choosing archives to extract */
"Unarchive" = "Распаковать";

/* Status text when asking for a password */
"You need to supply a password to open the archive \"%@\"." = "Введите пароль для открытия архива «%@».";

/* Title for nagging alert on first startup */
"Where should The Unarchiver extract archives?" = "Куда The Unarchiver должен распаковать архивы?";

/* Content of nagging alert on first startup */
"Would you like The Unarchiver to extract archives to the same folder as the archive file, or would you prefer to be asked for a destination folder for every individual archive?" = "Всегда извлекать в одну и ту же папку, или каждый раз запрашивать путь для извлечения.";

/* Button to ask every time in nagging alert on first startup */
"Ask every time" = "Спрашивать каждый раз";

/* Button to extract to the same folder in nagging alert on first startup */
"Extract to the same folder" = "Извлечь в ту же папку";

/* Informative text in the file panel shown when trying to gain sandbox access */
"The Unarchiver does not have permission to write to this folder. To allow The Unarchiver to write to this folder, simply click \"Extract\". This permission will be remembered for this folder, and The Unarchiver will not need to ask for it again." = "The Unarchiver необходимо ваше разрешение на сохранение извлеченных файлов в выбранной папке. Нажмите «Извлечь», чтобы подтвердить это действие.";

/* Informative text in the file panel shown when trying to gain sandbox access for multi-part archives */
"The Unarchiver needs to search for more parts of this archive, but does not have permission to read the folder. To allow The Unarchiver to search in this folder, simply click \"Search\". This permission will be remembered for this folder, and The Unarchiver will not need to ask for it again." = "The Unarchiver необходимо ваше разрешение на поиск других томов выбранного архива в этой папке. Нажмите «Поиск», чтобы подтвердить это действие.";

/* Panel OK button title when searching for more archive parts */
"Search" = "Искать";

/* Check for updates menu item */
"Check for Updates…" = "Проверить обновления…";

/* Error messages from XADMaster.framework. Some are converted to friendlier messages in English, too. */
/* Common errors */

"Attempted to read more data than was available" = "Отсутствует часть файла архива";
"Opening file failed" = "Не удалось открыть файл";
"Missing or wrong password" = "Указан неверный пароль";
"Wrong checksum" = "Файл архива поврежден";
"Could not create directory" = "Невозможно создать папку";

/* Uncommon or unused errors */
"Unknown error" = "Неизвестная ошибка";
"Failed to write to file" = "Не удалось записать файл";
"Function called with illegal parameters" = "Функция вызвана с недопустимыми параметрами";
"Not enough memory available" = "Недостаточно памяти";
"Data is corrupted" = "Данные повреждены";
"File is not fully supported" = "Файл не поддерживается полностью";
"Required resource missing" = "Отсутствует необходимый ресурс";
"Error on decrunching" = "Ошибка декомпрессии";
"Unknown file type" = "Неизвестный тип файла";
"File, disk has been skipped" = "Файл, диск пропущен";
"User cancelled extraction" = "Процесс прерван пользователем";
"File already exists" = "Файл уже существует";
"Verify failed (disk hook)" = "Ошибка при проверке (disk hook)";
"Wrong drive geometry" = "Ошибочные параметры диска";
"Unknown data format" = "Неизвестный формат данных";
"Source contains no files" = "Архив не содержит файлов";
"Unknown filesystem" = "Неизвестная файловая система";
"Name of file exists as directory" = "Имя файла совпадает с именем существующей папки";
"Buffer was too short" = "Буфер слишком мал";
"Text encoding was defective" = "Кодировка текста повреждена";
"Could not create symlink" = "Не удалось создать символическую ссылку";

"AlertTitle_SetFileTypeAssociationAppStore" = "Хотите всегда открывать выбранные типы файлов с помощью The Unarchiver?";
"AlertDescription_SetFileTypeAssociationAppStore" = "Нажмите «Свойства» в контекстном меню файла и выберите The Unarchiver из списка «Открывать в программе». Нажмите «Настроить...», чтобы применить для всех подобных файлов.";

"AlertTitle_UnsetFileTypeAssociationAppStore" = "При желании, вы можете назначить открытие выбранных файлов в другой программе.";
"AlertDescription_UnsetFileTypeAssociationAppStore" = "Нажмите «Свойства» в контекстном меню файла и выберите нужную программу из списка «Открывать в программе». Нажмите «Настроить...», чтобы применить для всех подобных файлов.";

/* About window */
"Standalone" = "Независимый";

/* Extracted view */
"extracted" = "распакован";
